SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( FDB_N2_69555   
	comment( Class N2 )
	Type ( Engine )
	WagonShape ( FDB_N2_69555.s )
	Size  ( 2.718m 3.79m 11.36m )
	CentreOfGravity ( 0m 1.7m 0m )
	Centre ( 0m 0m 0m )
	Mass ( 84.05t )
	WheelRadius ( 0.4825m )
	InertiaTensor ( Box (2.7m 3.79m 11.0m) )

	Coupling (
			Type ( chain )
			Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7N/m/s 0.2e7N/m/s )
			Break ( 1e8N 1e8N )
			r0 ( 10cm 1e9 )
			)

	CouplingHasRigidConnection ()
	Velocity (0.1m/s)

	)

	Buffers (
			Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 1e6N/m/s 1e6N/m/s )
			r0 ( 0cm 1e9 )
			)
			Centre ( 1.5 )
			Radius ( 1 )
			Angle ( 2.5deg )
	)
	IntakePoint ( 0.7 2.4 FuelWater )
	IntakePoint ( -1.99 2.73 FuelCoal )
		
	Adheasion ( 0.15 0.240 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 240kN )
	DerailBufferForce ( 400kN )
	NumWheels ( 6 )
	Friction (
			8071N/m/s		0		1mph		13.18N/m/s		1.8
			5.1N/rad/s		1		-1rad/s		0		1
			)
	
	BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
	BrakeSystemType ( "Vacuum_single_pipe" )
	MaxBrakeForce( 55000N )

	MaxHandbrakeForce( 55000N )
	NumberOfHandbrakeLeverSteps( 100 )
	
      MaxReleaseRate( 2 )
      MaxApplicationRate( 5 )
      MaxAuxilaryChargingRate( 21 )
      BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )        
	
    	Sound ( "..\\..\\Scotsman\\SOUND\\fscoteng.sms" )
	
	    Lights	( 12
			Light	(
			comment( Flickering front oil lamp )
			Type		( 0 )
			Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					TimeOfDay ( 0 )
					Weather ( 0 )
					Coupling ( 0 )  
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
					Duration ( 0.05 )
					LightColour ( ff808000 )
					Position ( 0 3.3 4.7610 ) 
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( -10 -10 -10 )
					)
			State	(
					Duration ( 0.03 )
					LightColour ( 80ff7200 )
					Position ( 0 3.3 4.7610 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.25 )
					Elevation ( -10 -10 -10 )
					)
				)
			)

			Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
			Headlight ( 0 )
			Unit ( 0 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( eeff8800 )
			Position ( -0 2.15 -1.90 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1.3 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( eeff8800 )
			Position ( -0 2.10 -1.90 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1.3 )
									
					)
					
				)
			)

		
			Light	(	
			comment( Gauge Glass Lamp A )
			Type ( 0 )
			Conditions (
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	( 1
			State	(
			Duration ( 0.0 )
			LightColour ( 80ff7200 )
			Position ( 0 3.150 -2.05 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 0.3 )
					)
				)
			)
			Light	(	
			comment( Gauge Glass Lamp A )
			Type ( 0 )
			Conditions (
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 0 )
			FadeOut	( 0 )
			Cycle	( 0 )
			States	( 1
			State	(
			Duration ( 0.0 )
			LightColour ( 80ffe610 )
			Position ( 0 3.150 -2.05 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 0.3 )
					)
				)
			)
		
			Light ( 
                  comment( Ashpan flashes ) 
			Type ( 0 ) 
			Conditions ( 
			Headlight ( 3 ) 
			Unit ( 0 ) 
			) 
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 1 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 01.4 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.4 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.2 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 3 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 5 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 3 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.50 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -.5 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
                  )
               )
          )
		Light ( 
                  comment( Chimney Sparks RS1AA ) 
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			TimeOfDay ( 0 )
			Weather ( 0 )
			Coupling ( 0 )  
			)
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.80 )

 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.42 3.8 )

			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.72 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.52 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.72 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.92 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.32 3.8 )
  
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.52 3.8 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.92 3.5 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.226 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.35 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.55 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.25 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 4.22 3.8 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 00000000 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.225 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.233 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 9.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.230 ) 
                  )
               )
          )

		Light ( 
                  comment( Chimney Sparks RS1AA ) 
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			TimeOfDay ( 0 )
			Weather ( 0 )
			Coupling ( 0 )  
			)
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )

			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.234 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
  
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.234 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.2235 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.23 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 8.22 3.8 )
 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0 9.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.5 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 0 6.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.235 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 5.22 3.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( 0 7.22 5.8 )
 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.236 ) 
                  		)
               		)
         		 )
			
		Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 0.975 )
			FadeOut	( 0.975 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.45 -1.775 )
			Azimuth ( -90 -90 -90 )
			Transition ( 0 )
			Radius ( 1.3 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.62 -1.775 )
			Azimuth ( -180 -180 -180 )
			Transition ( 0 )
			Radius ( 1.3 )
							
					)
				)
			)

			Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
			Headlight ( 0 )
			Unit ( 2 )
			)
			FadeIn	( 0.75 )
			FadeOut	( 0.75 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.42 -1.775 )
			Azimuth ( 45 45 45 )
			Transition ( 0 )
			Radius ( 1.35 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.55 -1.775 )
			Azimuth ( 180 180 180 )
			Transition ( 0 )
			Radius ( 1.35 )
									
					)
				)
			)

			Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
			Headlight ( 3 )
			Unit ( 2 )
			)
			FadeIn	( 1.95 )
			FadeOut	( 1.95 )
			Cycle	( 0 )
			States	(	2
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.55 -1.775 )
			Azimuth ( 180 180 180 )
			Transition ( 0 )
			Radius ( 1.34 )
			)
			State	(
			Duration ( 0.05 )
			LightColour ( 80ff7200 )
			Position ( -0 0.45 -1.775 )
			Azimuth ( 180 180 180 )
			Transition ( 0 )
			Radius ( 1.34 )
									
					)
				)
			)
		
		)
	)


Engine ( FDB_N2_69555  
	comment( Class N2 )
	Effects
	(
		SteamSpecialEffects
		(
			comment
			(
			the format of these little blocks is as follow:

			offset.x offset.y offset.z
			normal.x normal.y normal.z
			width in metres

			defining the offset from the shape pivot point
			where steam / smoke should appear, the direction
			it should go and the width of the nozzle
			)

			WhistleFX
			(
			-0.3 3.80 -1.5
			0 0.8 0.1
			0.2
			)

			SafetyValvesFX
			(
			0 3.65 -1.275
			0 0.75 0.1
			0.3
			)
			SafetyValvesFX
			(
			0 3.65 -1.275
			0 1.3 0.1
			0.2
			)
	
			StackFX
			(
			0 3.90 3.80
			0 1 0.1
			0.2
			)
			StackFX
			(
			0 3.90 3.8
			0 1 0.1
			0.2
			)
			CylindersFX
			(
			-0.4 0.45 3.9795
			0 -0.545 1.432
			0.1
			)

			CylindersFX
			(
			0.4 0.45 3.9795
			0 -0.545 1.432
			0.1
			)
			DrainpipeFX
			(
			-1.5 1.258 -3.886
			-0.4 -1 -0.2
			0.05
			)

		)
	)

	Wagon ( FDB_N2_69555 )
	Type ( Steam )
	IsTenderRequired( 0.1 )
	MaxPower ( 751KW )
	MaxForce ( 88.72KN )
	MaxVelocity ( 75mph )
	WheelRadius ( 34in )
	Sanding ( 1e9mph )
	NumWheels ( 6 )
	BoilerLength ( 5.28m )
	BoilerRadius ( 0.7m )
	BoilerVolume ( "161*(ft^3)" )
	BoilerEffectivity ( 1.2 )
	DraftingEffect ( 1.2 )
	BoilerResponsiveness ( 1 )
	CoalBurnage ( 4.7lb/hp/h )
	MaxBoilerOutput ( 22000lb/h )
	NumCylinders ( 2 )
	CylinderStroke ( 26in )
	CylinderDiameter ( 19in )
	CylinderVolume ( "8.53*(ft^3)" )
	CylinderEffectivity ( 3.3 )
	CutoffMaxReverse( -0.75 )
	CutoffMaxForward( 0.75 )
	SteamSmallestCutoff( 8 )
	InjectorSizes ( 10mm 10mm )
	ExhaustLimit ( 23000lb/h )
	SteamGaugeGlassHeight( 10 )
	PrimingFactor ( 1 )
	SteamMinPrimingLevel ( 1 )
	SteamPrimingPowerLossProportion ( 0.20 )
	SteamPrimingWaterUsageIncreaseProportion ( 0.25 )
	SteamPrimingInjectorsFailAtLevel ( 1.25 )
	SteamPrimingReductionWithCylinderCocksOpen ( 0.25 )
	BlastExponent ( 0.6 )
	MaxBoilerPressure ( 170psi )
	MaxFireMass ( 975lb )
	IdealFireMass ( 950lb )
	MaxWaterMass ( 4206lb )  
	SafetyValvesSteamUsage ( 7500lb/h )
	ShovelCoalMass ( 20lb )
	SmokeCombustion ( "300*(ft^3)" )
	CriticalBlowbackLevel ( 1 )	
	MaxTenderCoalMass ( 8960lb )
	MaxTenderWaterMass ( 20000lb )
	comment( 0 for live steam, 1 for exhaust steam )
	InjectorTypes( 0 1 )
	InjectorLimits1 ( 60psi 0.22 1 )
	InjectorLimits2 ( 60psi 0.20 1 )
	Injector1FeedrateMultiplierExhaust ( 1.15 )
      Injector1FeedrateMultiplierLive ( 0.95 )
      Injector2FeedrateMultiplierExhaust ( 1.15 )
      Injector2FeedrateMultiplierLive ( 0.95 )
      Injector1WaterValveVariance ( 0.75 )
      Injector2WaterValveVariance ( 0.75 )

	SuperHeater ( 1.24 )
	SteamSmokeUnitsPerPoundOfFuel( 0.80 )
	SteamMaxSmokeUnitsReleaseRate( 20 )
	MaxSteamHeatingPressure( 50 )
	SafetyValvePressureDifference( 5 )
	SteamFiremanMaxConstantFiringRate ( 4875 )
	BasicSteamUsage ( 1750lb/h )
	BasicCoalUsage ( 100lb/h )
	
	CylinderCocksPowerEfficiency ( 0.9 )
	SteamCylinderCocksOperation( Manual )
	NumberOfDamperSteps( 9 )
      RegulatorValveType ( Twin_port )
	RegulatorPilotValveExponent( 0.5 )
	RegulatorPilotValveFullOpening( 0.3 )
	RegulatorSecondValveExponent( 0.95 )
	RegulatorSecondValveStartPosition( 0.5 )
	RegulatorMainValveInitialOpenning( 0.55 )

	SteamBlowerEffectExponent( 0.9 )
	SteamBlowerEfficiencyExponent( 1.1 )
	SteamBlowerMaxSteamUsageRate( 1200 )comment( lbs/h )
	SteamBlowerMaxProportionOfBlastEffect( 0.175 )
	SteamWaterScoopMinPickupSpeed( 250 )comment( mph )
	SteamWaterScoopMaxPickupSpeed( 750 )comment( mph )
	SteamWaterScoopResistance( 1N )
	comment( pounds per second. 0gallons per minute max. )
	SteamWaterScoopMaxPickupRate( 1 )

	VacuumBrakesSmallEjectorPowerRating( 3.5 )
	VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
	VacuumBrakesSmallEjectorUsageRate( 410 )
	VacuumBrakesLargeEjectorUsageRate( 1800 )
	VacuumBrakesHasVacuumPump( 0 )
	TrainBrakesPipeLeakRate ( 20 )
	TrainBrakesControllerMaxReleaseRate( 2 )
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 21 )
	EngineBrakesControllerHasProportionalBrake( 1 )
      EngineBrakesProportionalBrakeLag( 0.9 )
	BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
	BrakesTrainBrakeType ( "Vacuum_single_pipe" )
      BrakesEngineControllers( "Hand, Train" )

	CabView ( scotsman.cvf )
	HeadOut (  -1.375 2.95 -2.625  )

        EngineControllers (
        comment( Engine controls )
        
            Regulator ( 0 1 0.02 0 
             NumNotches( 0 )
            )

            Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )
            )
            Brake_Train ( 0 0.99 0.0475 0.65 
            NumNotches( 3
            Notch( 0      1 TrainBrakesControllerReleaseStart )
            Notch( 0.20   1 TrainBrakesControllerRunningStart )
            Notch( 0.30   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
            NumNotches( 0 )
            )
            FireDoor ( 0 1 0.075 1 
            NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.02 
            NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.035 0 
            NumNotches( 5 
		Notch ( 0     	0 Dummy )
            Notch ( 0.25   	0 Dummy )
            Notch ( 0.5	  	0 Dummy )
            Notch ( 0.75   	0 Dummy )
            Notch ( 1   	0 Dummy )
				
			)
            )
            Shovel ( 0 1 1 0 
            NumNotches( 3
		Notch ( 0     	0 Dummy )
		Notch ( 0.5   	0 Dummy )
		Notch ( 1   	0 Dummy )
			)
		)
            DampersFront ( 0 1 0.1 0.15 
            NumNotches ( 9
		Notch ( 0		0 Dummy )
		Notch ( 0.125	0 Dummy )
		Notch ( 0.250	0 Dummy )
            Notch ( 0.375     0 Dummy )
            Notch ( 0.500   	0 Dummy )
            Notch ( 0.625  	0 Dummy )
            Notch ( 0.750   	0 Dummy )
            Notch ( 0.875  	0 Dummy )
		Notch ( 1		0 Dummy )
			)	
		)

		Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
            NumNotches( 2 
		Notch ( 0   	0 Dummy )
		Notch ( 1   	0 Dummy )

			)
            )
            
            Injector2Water ( 0 1 0.1 0 
            NumNotches( 4 
		Notch ( 0     	0 Dummy )
            Notch ( 0.5   	0 Dummy )
            Notch ( 0.75   	0 Dummy )
            Notch ( 1   	0 Dummy )
       		
			)
		)

            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

	comment( fire temp, fire mass, water mass, boiler pressure,
		  water level, tender_water_mass, smoke_quantity,
		  tender_coal_mass, fire_condition, coal quality )
		
	EngineVariables( 850 975 3195 175 0.75 2000 100 8960 1.10 0.8 )
    	Sound ( "..\\..\\Scotsman\\SOUND\\fscotcab.sms" )
    	Name ( "FDB_N2_69555" )
 	Description (
 	"London & North Eastern Railway/BR No.69555 steam locomotive, modeled as it was in the 1950s."+ 
 	"Train Simulator, No. 69555 pulls a consist of suburban passenger and freight cars on the"+ 
 	"East Coast Main Line between London and Scotland.\n\n"+
 	"Locomotive type & no.: LNER N2 0-6-2T 4MT, No.69555\n\n"+
 	"Power source: 170 psi hand-fired, coal burning boiler\n\n"+
 	"Wheel configuration: Six 68 inch ( 1.72m ) diameter driving wheels in a 2-6-2T configuration\n\n"+
 	"Max. speed: 75 mph ( 124 km/h ) under favorable conditions\n\n"+
 	"Height: 13 ft. 0 in. ( 4.0 m )\n\n"+
 	"Width: 8 ft.9 in. ( 2.5 m ) ( over footplate )\n\n"+
 	"Length ( locomotive & tender ): 59 ft. 6 in. (18.01 m )\n\n"+
 	"Weight ( locomotive & tender ): 123tons 12cwt U.K. tons \n\n"+
 	"Tractive effort: 19,945lb (13,650 kg)\n\n"+
 	"Coal capacity: 4 U.K. tons ( 4.06 metric tons )\n\n"+
 	"Water capacity: 2000 U.K. gallons ( 9092.184 liters )\n\n"+
 	"Brakes: Vacuum, operates at 21 in. Hg\n\n" 
)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)